<?php

return [

    'between' => [
        'numeric' => ':атрибуты :min және :max арасында болуы керек.',
        'file' => ':атрибуты :min және :max килобайт арасында болуы керек.',
        'string' => ':атрибуты :min және :max таңбаларының арасында болуы керек.',
        'array' => ':атрибутында :min және :max элементтері болуы керек.',
    ],
    'boolean' => ':атрибут өрісі ақиқат немесе жалған болуы керек.',
    'confirmed' => ':атрибут растамасы сәйкес келмейді.',
    'current_password' => 'Құпия сөз дұрыс емес.',
    'date' => ':атрибуты жарамды күн емес.',
    'email' => ':атрибуты жарамды электрондық пошта мекенжайы болуы керек.',
    'file' => ':атрибуты файл болуы керек.',
    'image' => ':атрибуты фото-картина болуы керек.',
    'in' => 'Таңдалған :атрибут жарамсыз.',
    'integer' => ':атрибуты бүтін сан болуы керек.',
    'mimes' => ':атрибуты :мәндер түріндегі файл болуы керек.',
    'mimetypes' => ':атрибуты :мәндер түріндегі файл болуы керек.',
    'max' => [
        'numeric' => ':атрибуты :max мәнінен үлкен болмауы керек.',
        'file' => ':атрибуты :max килобайттан үлкен болмауы керек.',
        'string' => ':атрибуты :max таңбаларынан үлкен болмауы керек.',
        'array' => ':атрибутында :max элементтерінен көп болмауы керек.',
    ],
    'min' => [
        'numeric' => ':атрибуты кемінде :min болуы керек.',
        'file' => ':атрибуты кемінде :min килобайт болуы керек.',
        'string' => ':атрибуты кемінде :min таңбалары болуы керек.',
        'array' => ':атрибутында кемінде :min элементтері болуы керек.',
    ],
    'numeric' => ':атрибуты сан болуы керек.',
    'password' => 'Құпия сөз дұрыс емес.',
    'required' => ':атрибут өрісі қажет.',
    'string' => ':атрибут өрісінде :мәндерге арналған жазбалар болуы керек.',
    'timezone' => ':атрибуты жарамды уақыт белдеуі болуы керек.',
    'unique' => ':атрибуты әлдеқашан алынған.',

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    'attributes' => [],

];
